app/controllers/categories_controller.rb

  def index
    @categories = Category.all(:order => "lft")
---
SELECT `categories`.* FROM `categories` ORDER BY lft

  def show
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) LIMIT 1

  def edit
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 7) LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `parent_id`, `lft`, `rgt`, `depth`, `html`, `created_at`, `updated_at`) VALUES ('Bike', NULL, 1, 2, NULL, '', '2011-01-26 03:49:20', '2011-01-26 03:49:20')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 7) LIMIT 1
UPDATE `categories` SET `lft` = CASE WHEN `lft` BETWEEN 2 AND 2 THEN `lft` + 4 - 2 WHEN `lft` BETWEEN 3 AND 4 THEN `lft` + 2 - 3 ELSE `lft` END, `rgt` = CASE WHEN `rgt` BETWEEN 2 AND 2 THEN `rgt` + 4 - 2 WHEN `rgt` BETWEEN 3 AND 4 THEN `rgt` + 2 - 3 ELSE `rgt` END, `parent_id` = CASE WHEN id = 2 THEN 1 ELSE `parent_id` END